## 04. Pandas(1)
- 파이썬 기반의 강력하고 사용하기 쉬운 데이터 분석 및 조작 라이브러리!!

In [137]:
import pandas as pd
import numpy as np

print(pd.__version__)

2.3.1

### Pandas의 핵심 자료 구조
- Series
- DataFrame

### Series
- 인덱스(라벨)이 붙은 1차원 배열
- 인덱스 이름을 직접 지정할 수 있음

In [2]:
# 시리즈 생성
# 1. 리스트로 생성
data = [10,20,30,40]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
# 2. 인덱스를 직접 지정
data = [10,20,30,40]
s = pd.Series(data, index=["a", "b", "c", "d"])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
# 3. 딕셔너리로 시리즈 생성
data = {"서울": 100, "부산": 200, "대구": 300}
s = pd.Series(data)
print(s)

서울    100
부산    200
대구    300
dtype: int64

In [5]:
# 4. 하나의 값으로 시리즈 생성
s = pd.Series(7, index=["가", "나", "다"])
print(s)

가    7
나    7
다    7
dtype: int64

In [8]:
# 시리즈의 주요 속성
data = [10,20,30,40]
s = pd.Series(data, index=["a", "b", "c", "d"], name = "test data")

print("values:", s.values)  # 실제 데이터 배열
print("index:", s.index)    # 인덱스 객체
print("dtype:", s.dtype)    # 실제 데이터의 타입
print("size:", s.size)      # 데이터의 개수
print("shape:", s.shape)    # 배열의 형태
print("name:", s.name)      # 시리즈의 이름

values: [10 20 30 40]
index: Index(['a', 'b', 'c', 'd'], dtype='object')
dtype: int64
size: 4
shape: (4,)
name: test data

In [ ]:
# 시리즈의 연산
s1 = pd.Series([10,20,30], index=["a", "b", "c"])
s2 = pd.Series([5,6,7], index=["b", "c", "d"])

result = s1 + s2
print(result)
print()
result = s1 * s2
print(result)
print()
result = s1 - s2
print(result)

a     NaN
b    25.0
c    36.0
d     NaN
dtype: float64

a      NaN
b    100.0
c    180.0
d      NaN
dtype: float64

a     NaN
b    15.0
c    24.0
d     NaN
dtype: float64

In [9]:
# 정렬되지 않은 인덱스 간 연산
# 인덱스 기준으로 연산 후 정렬해줌
s1 = pd.Series([10,20,30], index=["b", "a", "c"])
s2 = pd.Series([5,6,7], index=["c", "b", "a"])

result = s1 + s2
print(result)

a    27
b    16
c    35
dtype: int64

In [10]:
# 브로드 캐스팅
s = pd.Series([5,10,15], index=["a", "b", "c"])

print(s + 3)
print(s * 2)

a     8
b    13
c    18
dtype: int64
a    10
b    20
c    30
dtype: int64

In [11]:
# 불리언 연산 및 인덱싱
s = pd.Series([50,60,70,80,90,100],  index=["a", "b", "c", "d", "e", "f"])

# 불리언 연산(조건식)
mask = s > 70
print(mask)
print(s[mask])

a    False
b    False
c    False
d     True
e     True
f     True
dtype: bool
d     80
e     90
f    100
dtype: int64

In [13]:
# 시리즈와 NumPy 배열 연산 / 파이썬 리스트 연산
s1 = pd.Series([10,20,30], index=["a", "b", "c"])
a = np.array([1,2,3])
l = [100,200,300]

print(s1 + a)
print(s1 + l)

a    11
b    22
c    33
dtype: int64
a    110
b    220
c    330
dtype: int64

In [43]:
# 실습. Series 연습
# 1. 파이썬 리스트 [5, 10, 15, 20]을 이용해 Series를 생성하세요.
data = [5, 10, 15, 20]
s = pd.Series(data)
print("📝문제1:\n",s)
print()
# 2. 값 [90, 80, 85, 70]에 대해 인덱스를 각각 '국어', '영어', '수학', '과학'으로 지정한 Series를 만드세요
data = [90, 80, 85, 70]
s = pd.Series(data, index=['국어', '영어', '수학', '과학'])
print("📝문제2:\n",s)
print()
# 3. {'서울': 950, '부산': 340, '인천': 520} 딕셔너리를 이용해 Series를 만들고, 인천의 값을 출력하세요.
data = {'서울': 950, '부산': 340, '인천': 520}
s = pd.Series(data)
print("📝문제3:\n",s)
print(s["인천"])
print()
# 4. Series [1, 2, 3, 4]를 만들고, 데이터 타입(dtype)을 출력하세요.
data = [1, 2, 3, 4]
s = pd.Series(data)
print("📝문제4:\n","dtype:", s.dtype)
print()
# 5. 아래 두 Series의 합을 구하세요.
s1 = pd.Series([3, 5, 7], index=['a', 'b', 'c'])
s2 = pd.Series([10, 20, 30], index=['b', 'c', 'd'])
result = s1 + s2
print("📝문제5:\n",result)
print()
# 6. Series [1, 2, 3, 4, 5]의 각 값에 10을 더한 Series를 만드세요.
data = [1, 2, 3, 4]
s = pd.Series(data)
print("📝문제6:\n",s+10)

📝문제1:
 0     5
1    10
2    15
3    20
dtype: int64

📝문제2:
 국어    90
영어    80
수학    85
과학    70
dtype: int64

📝문제3:
 서울    950
부산    340
인천    520
dtype: int64
520

📝문제4:
 dtype: int64

📝문제5:
 a     NaN
b    15.0
c    27.0
d     NaN
dtype: float64

📝문제6:
 0    11
1    12
2    13
3    14
dtype: int64

### DataFrame
- 2차원 라벨 데이터 구조
- 시리즈를 모아놓은 것
- 행과 열이 있고, 행과 열에 대해 라벨을 부여할 수 있음

In [15]:
# DataFrame 생성
# 1. 딕셔너리로 생성
data = {
    "이름" : ["이안", "철수", "영희"], 
    "나이" : [5,6,7], 
    "도시" : ["서울", "뉴욕", "멜버른"], 
}

df = pd.DataFrame(data)
df

   이름  나이   도시
0  이안   5   서울
1  철수   6   뉴욕
2  영희   7  멜버른

In [16]:
# 2. 리스트의 리스트(2차원 리스트)로 생성
data = [[1,"a"], [2,"b"], [3,"c"]]
df = pd.DataFrame(data, columns = ["번호", "코드"])
print(df)

   번호 코드
0   1  a
1   2  b
2   3  c

In [17]:
# 3. 딕셔너리의 리스트로 생성
data = [
    {"이름":"이안", "나이":15, "사는 곳":"창동"},
    {"이름":"철수", "나이":10, "사는 곳":"뉴욕"},
    {"이름":"영희", "나이":5, "사는 곳":"도쿄"},
    {"이름":"민수", "나이":7, "사는 곳":"멜버른"},
]

df = pd.DataFrame(data)
df

   이름  나이 사는 곳
0  이안  15   창동
1  철수  10   뉴욕
2  영희   5   도쿄
3  민수   7  멜버른

In [18]:
# 4. 시리즈의 딕셔너리로 생성
s1 = pd.Series(['국어', '영어', '수학'], index=["a", "b", "c"])
s2 = pd.Series([100,90,85], index=["a", "b", "c"])
df = pd.DataFrame({"과목": s1, "점수": s2})
df

   과목   점수
a  국어  100
b  영어   90
c  수학   85

In [24]:
# 데이터 프레임 기본 속성
data = [
    {"이름":"이안", "나이":15, "사는 곳":"창동"},
    {"이름":"철수", "나이":10, "사는 곳":"뉴욕"},
    {"이름":"영희", "나이":5, "사는 곳":"도쿄"},
    {"이름":"민수", "나이":7, "사는 곳":"멜버른"},
]

df = pd.DataFrame(data)

print("shape:", df.shape)
print("columns:", df.columns)
print("index:", df.index)
print("dtypes:", df.dtypes)
print("values:", df.values)
print("info:")
df.info

shape: (4, 3)
columns: Index(['이름', '나이', '사는 곳'], dtype='object')
index: RangeIndex(start=0, stop=4, step=1)
dtypes: 이름      object
나이       int64
사는 곳    object
dtype: object
values: [['이안' 15 '창동']
 ['철수' 10 '뉴욕']
 ['영희' 5 '도쿄']
 ['민수' 7 '멜버른']]
info:

<bound method DataFrame.info of    이름  나이 사는 곳
0  이안  15   창동
1  철수  10   뉴욕
2  영희   5   도쿄
3  민수   7  멜버른>

In [44]:
# 실습.  DataFrame 연습
# 1. 다음 데이터로 DataFrame을 생성하고, 컬럼명을 '이름', '나이', '도시'로 지정하세요.
data = [['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '대구']]
df = pd.DataFrame(data, columns = ["이름", "나이", "도시"])
print("📝문제1:\n", df)
print()
# 2. 아래와 같은 딕셔너리로 DataFrame을 생성하세요.
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print("📝문제2:\n",df)
print()
# 3. 아래 데이터를 사용해 DataFrame을 만드세요.
data =  [{'과목': '수학', '점수': 90}, {'과목': '영어', '점수': 85}, {'과목': '과학', '점수': 95}]
df = pd.DataFrame(data)
print("📝문제3:\n",df)
print()
# 4. 아래 데이터를 사용해 DataFrame을 생성하되, 인덱스를 ['학생1', '학생2', '학생3']으로 지정하세요.
data = {'이름': ['민수', '영희', '철수'], '점수': [80, 92, 77]}
df = pd.DataFrame(data, index = ['학생1', '학생2', '학생3'])
print("📝문제4:\n",df)
print()
# 5. 아래 Series 객체 2개를 이용해 DataFrame을 만드세요.
kor = pd.Series([90, 85, 80], index=['a', 'b', 'c'])
eng = pd.Series([95, 88, 82], index=['a', 'b', 'c'])
data = {"한국어": kor,"영어": eng}
df = pd.DataFrame(data)
print("📝문제5:\n",df)
print()
# 6. 아래 딕셔너리로 DataFrame을 만들고, 컬럼 순서를 ['B', 'A']로 지정해 출력하세요.
data =  {'A': [1, 2], 'B': [3, 4]}
df = pd.DataFrame(data, columns = ['B', 'A'])
print("📝문제6:\n",df)
print()
# 7. 데이터를 DataFrame으로 만들고, 컬럼명을 ['product', 'price', 'stock']으로 변경하세요.
data = [['펜', 1000, 50], ['노트', 2000, 30]]
df = pd.DataFrame(data, columns = ['product', 'price', 'stock'])
print("📝문제7:\n",df)
print()
# 8. 아래 DataFrame을 생성한 뒤, '국가' 컬럼만 추출하세요.
data = {'국가': ['한국', '일본', '미국'], '수도': ['서울', '도쿄', '워싱턴']}
df = pd.DataFrame(data)
print("📝문제8:\n",df['국가'])

📝문제1:
     이름  나이  도시
0  홍길동  28  서울
1  김철수  33  부산
2  이영희  25  대구

📝문제2:
    A  B
0  1  4
1  2  5
2  3  6

📝문제3:
    과목  점수
0  수학  90
1  영어  85
2  과학  95

📝문제4:
      이름  점수
학생1  민수  80
학생2  영희  92
학생3  철수  77

📝문제5:
    한국어  영어
a   90  95
b   85  88
c   80  82

📝문제6:
    B  A
0  3  1
1  4  2

📝문제7:
   product  price  stock
0       펜   1000     50
1      노트   2000     30

📝문제8:
 0    한국
1    일본
2    미국
Name: 국가, dtype: object

In [83]:
# 데이터 탐색과 요약
data = {
    "이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원"],
    "나이": [23, 35, 31, 40, 28, 34],
    "직업": ["학생", "군인", "장군", "장군", "상인", "왕자"]
}
df = pd.DataFrame(data)

In [ ]:
# 데이터 앞부분 미리 보기 : head(n)
# 기본값 n = 5
df.head()
df.head(3)

    이름  나이  직업
0  홍길동  23  학생
1  이순신  35  군인
2  김유신  31  장군

In [50]:
# 데이터 뒷부분 미리 보기 : tail(n)
# 기본값 n = 5
df.tail()
df.tail(2)

    이름  나이  직업
4  장보고  28  상인
5  이방원  34  왕자

In [51]:
# info 함수
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   나이      6 non-null      int64
 2   직업      6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [ ]:
# describe() 함수
df.describe()                    # 기본적으로 수치형 컬럼만 요약
df.describe(include="object")    # 문자열 컬럼만 요약
df.describe(include="all")       # 모든 컬럼 요약

         이름         나이   직업
count     6   6.000000    6
unique    6        NaN    5
top     홍길동        NaN   장군
freq      1        NaN    2
mean    NaN  31.833333  NaN
std     NaN   5.913262  NaN
min     NaN  23.000000  NaN
25%     NaN  28.750000  NaN
50%     NaN  32.500000  NaN
75%     NaN  34.750000  NaN
max     NaN  40.000000  NaN

### 인덱싱과 슬라이싱

In [56]:
# 인덱싱
# 특정 컬럼(시리즈) 선택
df["이름"]

# 여러 컬럼을 리스트로 선택
df[["이름", "나이"]]

    이름  나이
0  홍길동  23
1  이순신  35
2  김유신  31
3  강감찬  40
4  장보고  28
5  이방원  34

In [ ]:
# 참고용

df = pd.DataFrame({
    'name': ['Tom', 'Jane', 'Mike'],
    'age': [20, 25, 30]
})

df["name"]
# . 으로도 조회가 가능함
# 변수명 규칙을 지켜야 함.
df.name

0     Tom
1    Jane
2    Mike
Name: name, dtype: object

In [58]:
# 슬라이싱
# 기본적으로 행 기준으로 동작
df[1:4]
df[-3:]

# 슬라이싱 후 인덱싱
df[1:4]["이름"]

1    이순신
2    김유신
3    강감찬
Name: 이름, dtype: object

In [59]:
# 슬라이싱은 행 기준으로 작동, 열 기준은 별도의 방법을 사용
df[:, 0:2]  # 에러

InvalidIndexError: (slice(None, None, None), slice(0, 2, None))

### iloc, loc

In [ ]:
# iloc
# integer location
# 정수 위치 기반의 인덱싱, 슬라이싱
# NumPy의 슬라이싱과 유사함(거의 같음)!!!

# 단일 행/열 선택
df.iloc[0]      # 첫번째 행
df.iloc[:, 1]   # 두번째 열

0    23
1    35
2    31
3    40
4    28
5    34
Name: 나이, dtype: int64

In [64]:
# 여러 행/열 동시 선택
df.iloc[1:4]
df.iloc[:, 0:2]
df.iloc[1:4, 0:2]

    이름  나이
1  이순신  35
2  김유신  31
3  강감찬  40

In [67]:
# fancy indexing
df.iloc[[0,2,4]]
df.iloc[:,[1,2]]
df.iloc[[0,2,4],[1,2]]

   나이  직업
0  23  학생
2  31  장군
4  28  상인

In [69]:
# 음수 인덱스로 슬라이싱
df.iloc[-1]
df.iloc[:, -2:]

   나이  직업
0  23  학생
1  35  군인
2  31  장군
3  40  장군
4  28  상인
5  34  왕자

In [ ]:
# loc
# location의 약자
# 라벨의 이름 기준으로 인덱싱/슬라이싱
# 단일 행/열 선택
# 시작과 끝을 모두 포함
# 음수 인덱스 사용 x
df.loc[0]
df.loc[:,"이름"]

0    홍길동
1    이순신
2    김유신
3    강감찬
4    장보고
5    이방원
Name: 이름, dtype: object

In [72]:
# 여러 행/열 선택
df.loc[2:4,["이름", "직업"]]

    이름  직업
2  김유신  장군
3  강감찬  장군
4  장보고  상인

In [75]:
# 조건식
mask = df["나이"] >= 30
df.loc[mask, ["이름","나이"]]

    이름  나이
1  이순신  35
2  김유신  31
3  강감찬  40
5  이방원  34

In [87]:
# 컬럼을 인덱스로 지정
df2 = df.set_index("이름")
df2
df2.loc["이순신"]
df2.loc[["이순신", "강감찬", "장보고"]]

     나이  직업
이름
이순신  35  군인
강감찬  40  장군
장보고  28  상인

In [76]:
s1 = pd.Series(['국어', '영어', '수학'], index=["a", "b", "c"])
s2 = pd.Series([100,90,85], index=["a", "b", "c"])
df = pd.DataFrame({"과목": s1, "점수": s2})
df

   과목   점수
a  국어  100
b  영어   90
c  수학   85

In [ ]:
# 행에 라벨이 있을 경우 라벨을 이용해서 인덱싱/슬라이싱 가능
df.loc[["a","c"], ["과목"]]

   과목
a  국어
c  수학

In [146]:
# 실습. DataFrame 연습
data = {
"이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원", "최무선", "정도전"],
"나이": [23, 35, 31, 40, 28, 34, 42, 29],
"직업": ["학생", "군인", "장군", "장군", "상인", "왕자", "과학자", "정치가"],
"점수": [85, 90, 75, 88, 92, 95, 87, 83]
}
df = pd.DataFrame(data)
df

    이름  나이   직업  점수
0  홍길동  23   학생  85
1  이순신  35   군인  90
2  김유신  31   장군  75
3  강감찬  40   장군  88
4  장보고  28   상인  92
5  이방원  34   왕자  95
6  최무선  42  과학자  87
7  정도전  29  정치가  83

In [ ]:
# 1. iloc을 사용해 인덱스 2~5(포함 안함) 행, 1~3(포함 안함) 열만 선택해 출력하세요.
df.iloc[2:5, 1:3]

   나이  직업
2  31  장군
3  40  장군
4  28  상인

In [ ]:
# 2. loc을 사용해 인덱스 3~6(포함!) 행, '이름'과 '점수' 컬럼만 출력하세요.
df.loc[3:6,["이름", "점수"]]

    이름  점수
3  강감찬  88
4  장보고  92
5  이방원  95
6  최무선  87

In [ ]:
# 3. iloc을 사용해, 마지막 3개 행의 '직업'과 '점수' 컬럼만 선택해 출력하세요
df.iloc[-3:, -2:]

    직업  점수
5   왕자  95
6  과학자  87
7  정치가  83

In [ ]:
# 4. iloc을 사용해, 홀수번째(1, 3, 5, 7번 인덱스) 행, 모든 열을 선택하세요.
df.iloc[[1,3,5,7]]

    이름  나이   직업  점수
1  이순신  35   군인  90
3  강감찬  40   장군  88
5  이방원  34   왕자  95
7  정도전  29  정치가  83

In [ ]:
# 5. loc을 사용해, 인덱스 4~7번 행, '나이', '점수' 컬럼만 출력하세요.
df.loc[4:7,["나이", "점수"]]
df.loc[4:7,"나이":"점수":2]     # 이렇게도 풀 수 있음~

   나이  점수
4  28  92
5  34  95
6  42  87
7  29  83

In [ ]:
# 6. iloc을 사용해, 짝수번째(0,2,4,6) 행과 짝수번째(0,2) 열만 선택하세요.
df.iloc[0::2, [0,2]]

    이름   직업
0  홍길동   학생
2  김유신   장군
4  장보고   상인
6  최무선  과학자

### 통계함수

In [138]:
data = {
    "상품명": ["무선 이어폰", "스마트 워치", "텀블러", "노트북", "블루투스 스피커", "무드등"],
    "가격": [129000, 250000, 15000, 1200000, 85000, 22000],
    "재고": [23, 12, 54, 5, 17, 31]
}
df = pd.DataFrame(data)
df

        상품명       가격  재고
0    무선 이어폰   129000  23
1    스마트 워치   250000  12
2       텀블러    15000  54
3       노트북  1200000   5
4  블루투스 스피커    85000  17
5       무드등    22000  31

In [ ]:
df.describe(include="all")
df["가격"].describe

<bound method NDFrame.describe of 0     129000
1     250000
2      15000
3    1200000
4      85000
5      22000
Name: 가격, dtype: int64>

In [110]:
# 평균
print("평균:",df["가격"].mean())

# 중앙값
print("중앙값:",df["재고"].median())

# 표준편차
print("표준편차:",df["가격"].std())

# 분산
print("분산:",df["재고"].var())

# 값의 개수
print("값의 개수:",df["상품명"].count())

# 최대값
print("최대값:",df["가격"].max())

# 최소값
print("최소값:",df["가격"].min())

# 합계
print("합계:",df["가격"].sum())

평균: 283500.0
중앙값: 20.0
표준편차: 457130.5065295905
분산: 300.6666666666667
값의 개수: 6
최대값: 1200000
최소값: 15000
합계: 1701000

In [140]:
# 최대값 위치와 최소값의 위치
df.idxmax()
print("최대값 위치:", df["재고"].idxmax())

df.idxmin()
print("최소값 위치:", df["재고"].idxmin())

최대값 위치: 2
최소값 위치: 3

### 결측값 처리
- 결측값 : 값이 기록되지 않은 상태의 데이터
- NaN : Not a Number

In [123]:
data = {
    "이름": ["서준", "하은", "민준", "서연", "철수", "지민"],
    "나이": [22, 28, np.nan, 31, 27, 24],
    "점수": [89, np.nan, 83, 90, 88, 93]
}
df = pd.DataFrame(data)
df

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0   NaN
2  민준   NaN  83.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [129]:
# 결측값 탐지
# isnull 결측값이 맞으면 True 아니면 False를 반환
print(df.isnull())
print()

# 각 컬럼의 결측값의 수 계산
print(df.isnull().sum())

# 데이터의 전체 결측값 수 계산
df.isnull().sum().sum()

      이름     나이     점수
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4  False  False  False
5  False  False  False

이름    0
나이    1
점수    1
dtype: int64

np.int64(2)

In [130]:
# notnull  결측값이면 True 아니면 False를 반환
df.notnull()

     이름     나이     점수
0  True   True   True
1  True   True  False
2  True  False   True
3  True   True   True
4  True   True   True
5  True   True   True

In [131]:
# dropna 결측값이 있는 행 삭제
df2 = df.dropna()
df2

   이름    나이    점수
0  서준  22.0  89.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [132]:
# 결측값이 있는 열 삭제
df3 = df.dropna(axis = 1)
df3

   이름
0  서준
1  하은
2  민준
3  서연
4  철수
5  지민

In [125]:
# fillna 결측값을 0으로 대체
df4 = df.fillna(0)
df4

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0   0.0
2  민준   0.0  83.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 평균 값으로 결측값 채우기
avg_age = df["나이"].mean()
df["나이"] = df["나이"].fillna(avg_age)
df

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0   NaN
2  민준  26.4  83.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [ ]:
# 이전 값으로 결측값 채우기(forward fill)
df5 = df.fillna(method="ffill")
df5

C:\Users\Administrator\AppData\Local\Temp\ipykernel_16052\3509481149.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df5 = df.fillna(method="ffill")

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0  89.0
2  민준  26.4  83.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [135]:
# 뒤의 값으로 결측값 채우기(backward fill)
df6 = df.fillna(method="bfill")
df6

C:\Users\Administrator\AppData\Local\Temp\ipykernel_16052\956812758.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df6 = df.fillna(method="bfill")

   이름    나이    점수
0  서준  22.0  89.0
1  하은  28.0  83.0
2  민준  26.4  83.0
3  서연  31.0  90.0
4  철수  27.0  88.0
5  지민  24.0  93.0

In [181]:
# 실습. 통계함수·결측값 처리 연습
data = {
"도시": ["서울", "부산", "광주", "대구", np.nan, "춘천"],
"미세먼지": [45, 51, np.nan, 38, 49, np.nan],
"초미세먼지": [20, np.nan, 17, 18, 22, 19],
"강수량": [0.0, 2.5, 1.0, np.nan, 3.1, 0.0]
}
df = pd.DataFrame(data)
df

    도시  미세먼지  초미세먼지  강수량
0   서울  45.0   20.0  0.0
1   부산  51.0    NaN  2.5
2   광주   NaN   17.0  1.0
3   대구  38.0   18.0  NaN
4  NaN  49.0   22.0  3.1
5   춘천   NaN   19.0  0.0

In [176]:
# 1. ‘미세먼지’ 컬럼의 평균과 중앙값을 구하세요.
print("문제1.\n🌵'미세먼지' 평균:", df["미세먼지"].mean())
print("🌵'미세먼지' 중앙값:", df["미세먼지"].median())
print()
# 2. ‘초미세먼지’ 컬럼의 최댓값과 최솟값을 구하세요.
print("문제2.\n🌵‘초미세먼지’ 최대값:",df["초미세먼지"].max())
print("🌵‘초미세먼지’ 최소값:",df["초미세먼지"].min())
print()
# 3. 각 컬럼별 결측값 개수를 구하세요.
print("문제3.\n🌵각 컬럼별 결측값 개수:\n",df.isnull().sum())

문제1.
🌵'미세먼지' 평균: 45.75
🌵'미세먼지' 중앙값: 47.0

문제2.
🌵‘초미세먼지’ 최대값: 22.0
🌵‘초미세먼지’ 최소값: 17.0

문제3.
🌵각 컬럼별 결측값 개수:
 도시       1
미세먼지     2
초미세먼지    1
강수량      1
dtype: int64

In [177]:
# 4. 결측값이 하나라도 있는 행을 모두 삭제한 뒤, 남은 데이터의 ‘초미세먼지’ 평균을 구하세요.
df1 = df.dropna()
print("문제4.")
print("🌵'초미세먼지' 평균:",df1["초미세먼지"].mean())
df1

문제4.
🌵'초미세먼지' 평균: 20.0

   도시  미세먼지  초미세먼지  강수량
0  서울  45.0   20.0  0.0

In [174]:
# 5. 결측값을 모두 0으로 채운 뒤, ‘미세먼지’와 ‘초미세먼지’의 합계를 각각 구하세요.
df2 = df.fillna(0)
print("문제5.")
print("🌵'미세먼지' 합계:",df["미세먼지"].sum())
print("🌵'초미세먼지' 합계:",df["초미세먼지"].sum())
df2

문제5.
🌵'미세먼지' 합계: 183.0
🌵'초미세먼지' 합계: 96.0

   도시  미세먼지  초미세먼지  강수량
0  서울  45.0   20.0  0.0
1  부산  51.0    0.0  2.5
2  광주   0.0   17.0  1.0
3  대구  38.0   18.0  0.0
4   0  49.0   22.0  3.1
5  춘천   0.0   19.0  0.0

In [184]:
# 6. ‘미세먼지’ 컬럼의 결측값을 평균값으로 채운 뒤, 그 표준편차를 구하세요.
fd_mean = df["미세먼지"].mean()
print("문제6.")
df4 = df.copy()
df4["미세먼지"]=df["미세먼지"].fillna(fd_mean)
print("🌵'미세먼지' 표준편차:",df4["미세먼지"].std())
df4

문제6.
🌵'미세먼지' 표준편차: 4.444097208657794

    도시   미세먼지  초미세먼지  강수량
0   서울  45.00   20.0  0.0
1   부산  51.00    NaN  2.5
2   광주  45.75   17.0  1.0
3   대구  38.00   18.0  NaN
4  NaN  49.00   22.0  3.1
5   춘천  45.75   19.0  0.0